Repository: marcosjunqueira/sonar-l10n-pt-omegat
Catalog: tm/apisupport-omegat.tmx
Source language: en_us
Languages: pt_br

source: Position:
pt_br: Posição:

source: Separator After
pt_br: Separador Depois

source: Separator Before
pt_br: Separador Antes

source: Toolbar:
pt_br: Barra de Ferramentas

source: GUI registration Panel
pt_br: Painel de registro da GUI

source: Content Type in editor
pt_br: Tipo de contéudo no editor

source: Position in editor menu
pt_br: Posição no menu do editor

source: Include action in editor context menu
pt_br: Incluir ação no menu de contexto do editor

source: Include action in file type's context menu
pt_br: Incluir ação no menu de contexto do tipo de arquivo

source: Content Type to add action into
pt_br: Tipo de conteúdo ao qual adicionar a ação

source: Position of action in filetype context
pt_br: Posição da ação no menu de contexto de tipo de arquivo

source: Add global keyboard shortcut
pt_br: Adicionar atalho de teclado global

source: Global menu item checkbox
pt_br: Caixa de seleção de item do menu global

source: Gloabl keyboard shortcut checkbox
pt_br: Atalho de teclado global

source: Add keystroke
pt_br: Adicionar atalho

source: Remove keystroke
pt_br: Remover atalho

source: Add/Remove keystrokes
pt_br: Adicionar/Remover atalhos

source: List of defined keystrokes
pt_br: Lista dos atalhos definidos

source: Select menu where to put action
pt_br: Selecionar menu para ação

source: Position of action in menu
pt_br: Posicionamento da ação no menu

source: Add Separator After item in menu
pt_br: Adicionar separador depois de item no menu

source: Add Separator Before item in menu
pt_br: Adicionar separador antes de item no menu

source: Select toolbar to place action into
pt_br: Selecionar local para ação na barra de ferramentas

source: Position of action in toolbar
pt_br: Posição da ação na barra de ferramentas

source: HERE
pt_br: AQUI

source: SomeAction
pt_br: AlgumaAção

source: Add Shortcut
pt_br: Adicionar atalho

source: Class &Name:
pt_br: &Nome da classe:

source: Name, Icon, and Location
pt_br: Nome, Ícone e Local

source: &Shortcut:
pt_br: &Atalho:

source: Class already exists.
pt_br: Classe já existe.

source: Choose another name or package.
pt_br: Selecione outro nome ou outro pacote.

source: Class Name must be a valid Java identifier.
pt_br: Nome da classe deve ser um identificador válido de Java.

source: Global Toolbar Button was checked in the previous panel but there is no selected Icon.
pt_br: Botão global de barra de ferramentas foi selecionado no painel anterior, mas não há ícone selecionado.

source: No large icon (24x24) found.
pt_br: Nenhum ícone grande (24x24) encontrado.

source: File {0} not found in {1}.
pt_br: Arquivo "{0}" não foi encontrado em {1}.

source: You must specify a keyboard shortcut.
pt_br: Deve ser especificado um atalho de teclado.

source: Name, Icon and Location panel
pt_br: Painel de Nome, Ícone e Localização

source: Action Display Name
pt_br: Nome de Exibição da Ação

source: Browse for icon
pt_br: Procurar por ícone

source: Ta&b
pt_br: A&ba

source: C&lear
pt_br: &Limpar

source: Project Template
pt_br: Modelo de Projeto

source: Select Project
pt_br: Selecionar Projeto

source: Select Project panel
pt_br: Painel seletor de projeto

source: Browse Project button
pt_br: Procurar por botão do projeto

source: Select from opened projects combobox
pt_br: Selecionar a partir de um combobox de projetos abertos

source: &Template Name :
pt_br: Nome do &Modelo:

source: D&isplay Name :
pt_br: Nome de Ex&ibição:

source: C&ategory
pt_br: C&ategoria

source: &Project :
pt_br: &Projeto:

source: Name and Location Panel
pt_br: Painel de Nome e Localização

source: Template Name
pt_br: Nome do Modelo

source: No Projects opened
pt_br: Nenhum Projeto aberto

source: Projects with external roots are not supported.
pt_br: Projetos com raízes externas não são suportados.

source: A project needs to be selected.
pt_br: Deve ser selecionado um projeto.

source: Template Name is empty.
pt_br: Nome do Modelo está vazio.

source: Template Name is invalid, not a Java identifier.
pt_br: Nome do Modelo inválido, não é um identificador Java.

source: The NetBeans platform is missing required modules.
pt_br: Estão faltando módulos requeridos na plataforma NetBeans.

source: No NetBeans Platform defined.
pt_br: Nenhum NetBeans Platform definido.

source: Mime type and extensions
pt_br: Tipo MIME e extensão

source: Invalid mime type.
pt_br: Tipo MIME invalido.

source: Invalid extensions.
pt_br: Extensão inválida.

source: Language Support
pt_br: Suporte de Linguagem

source: &Mime Type:
pt_br: Tipo &MIME

source: &Extensions:
pt_br: &Extensões

source: (write space separated list of extensions here)
pt_br: (escreva as listas de separadores de espaço para extensões aqui)

source: Options Panel
pt_br: Painel de Opções

source: Choose Panel Type
pt_br: Escolha o Tipo de Painel

source: Create &Miscellaneous Panel
pt_br: Criar Painel em &Miscelâneas

source: Create &Primary Panel
pt_br: Criar Painel &Primário

source: &Title:
pt_br: &Título:

source: T&ool Tip:
pt_br: D&ica:

source: Category &Label:
pt_br: Rótu&lo da Categoria:

source: &Icon (32x32):
pt_br: &Ícone (32x32):

source: {0} is blank.
pt_br: {0} está vázio.

source: Title
pt_br: Título

source: Tooltip
pt_br: Dica

source: Category Name
pt_br: Nome da Categoria

source: Icon Path
pt_br: Caminho do Ícone

source: Category Label
pt_br: Rótulo da Categoria

source: Browse Icon
pt_br: Procurar Ícone

source: Create Miscellaneous Panel
pt_br: Criar Painel em Miscelâneas

source: Create Primary Panel
pt_br: Criar Painel Primário

source: Add NetBeans Platform
pt_br: Adicionar NetBeans Platform

source: &Add Platform...
pt_br: &Adicionar Plataforma...

source: &Close
pt_br: Fe&char

source: &NetBeans Platforms
pt_br: Platformas do &NetBeans

source: NetBeans Platform Manager
pt_br: Gerenciador de Plataformas do &NetBeans

source: Platform &Folder:
pt_br: Pasta da Plataforma:

source: Platform &Name:
pt_br: &Nome da Plataforma:

source: &Platform Name:
pt_br: Nome da &Plataforma:

source: &Platforms:
pt_br: &Plataformas:

source: Platform &Javadoc:
pt_br: &Javadoc da Plataforma:

source: Platform &Sources:
pt_br: Fonte&s da Plataforma:

source: Add F&older...
pt_br: Adici&onar Diretório...

source: Add &ZIP/Folder...
pt_br: Adicionar &ZIP/Diretório...

source: Move &Down
pt_br: Mover para &Baixo

source: Move &Up
pt_br: Mover para &Cima

source: Re&move
pt_br: Re&mover

source: File does not exist or does not contain valid NetBeans Sources.
pt_br: Arquivo não existe ou não contém código-fonte válido do NetBeans.

source: Platform Folder
pt_br: Diretório da Plataforma

source: The selected platform was already added to the NetBeans Platform Manager.
pt_br: A plataforma selecionada já foi adicionada ao Gerenciador de Plataformas do NetBeans.

source: Choose Platform Folder
pt_br: Selecione Diretório da Plataforma

source: Platform Name
pt_br: Nome da Plataforma

source: The Platform Name cannot be blank
pt_br: O Nome da Plataforma não pode estar em branco

source: The Platform Name is already in use.
pt_br: O Nome da Plataforma já está em uso.

source: Please choose a different name.
pt_br: Favor escolher um nome diferente.

source: Please choose a different name in the next step.
pt_br: Favor escolher um nome diferente no próximo passo.

source: The selected platform is not supported.
pt_br: A plataforma selecionada não é suportada.

source: Only platform versions 5.0 and higher are supported.
pt_br: Somente plataformas 5.0 e mais recentes são suportadas.

source: List of defined platforms
pt_br: Lista e plataformas definidas

source: Platform folder
pt_br: Diretório da Plataforma

source: Remove platform
pt_br: Remover plataforma

source: Add Platform
pt_br: Adicionar Plataforma

source: Add Platform, enter name
pt_br: Adicionar Plataforma, fornecer nome

source: New Platform name
pt_br: Novo nome da Plataforma

source: Add folder
pt_br: Adicionar diretório

source: List of javadocs
pt_br: Lista de javadocs

source: Move down button
pt_br: Botão para mover para baixo

source: Move up button
pt_br: Botão para mover para cima

source: List of modules
pt_br: Lista de módulos

source: List of sources
pt_br: Lista de fontes

source: Platform chooser panel
pt_br: Painel seletor de plataforma

source: Platform Name field
pt_br: Campo de Nome de Plataforma

source: Harness supplied with &IDE
pt_br: Harness fornecido com a &IDE

source: Harness supplied with P&latform
pt_br: Harness fornecido com a &Platform

source: &Other:
pt_br: &Outro:

source: &Browse...
pt_br: &Procurar...

source: Selected Harness &Version:
pt_br: Selecione a &Versão do Harness:

source: Upgrade 5.0 Build Harnesses
pt_br: Atualizar Construtor Harnesses para o 5.0

source: <html>You have some custom NetBeans platforms which are still set to use the 5.0 version of the module build harness.<br>While this version still works, you will be missing some functionality and fixes in the newer harness.<br>Do you wish to upgrade to the new harness for these platforms?<br>(You can always specify a harness in <b>NetBeans Platform Manager</b>.)
pt_br: <html>Você tem algum plataforma NetBens habitual que ainda está configurada para usar a versão 5.0 para o construtor de módulo harness.<br>Enquanto essa versão ainda estiver operando, você poderá perder alguns funcionalidades e dificuladades num novo harness.<br>Você deseja atualizar o novo harness para essa plataforma?<br>(Você sempre pode especificar em <b>Gerenciador de Plataforma do Netbeans</b>.)

source: Upgrade
pt_br: Atualização

source: XML Layer
pt_br: XML de Camada

source: <this layer>
pt_br: <esta camada>

source: <this layer in context>
pt_br: <esta camada no contexto>

source: Please Wait...
pt_br: Aguarde...

source: {0} <no such bundle: {1}>
pt_br: {0} <pacote inexistente: {1}>

source: <separator>
pt_br: <separador>

source: <instance from {0}>
pt_br: <instância de {0}>

source: <instance of {0}>
pt_br: <instância de {0}>

source: Localize Name...
pt_br: Nome Localizado...

source: Localized display name:
pt_br: Nome de exibição localizado:

source: Choose Localized Display Name
pt_br: Escolher o Nome de Exibição Localizado

source: Pick Icon...
pt_br: Escolher Ícone...

source: Open Layer File(s)
pt_br: Abrir Arquivo de Camada

source: <exported services>
pt_br: <serviços exportados>

source: <all services>
pt_br: <todos os serviços>

source: META-INF services
pt_br: serviços META-INF

source: The service {0} already exists.
pt_br: O serviço {0} já existe.

source: &Add New Service...
pt_br: &Adicionar Novo Serviço...

source: Add Service Class
pt_br: Adicionar Classe de Serviço

source: &Class Name
pt_br: Nome da &Classe

source: Select a Class
pt_br: Selecione uma Classe

source: Add Meta-Inf Service
pt_br: Adicionar Serviço Meta-Inf

source: Class name edit field
pt_br: Campo de edição do nome da Classe

source: Could not find module {0} to depend on.
pt_br: Não pode encontrar o módulo {0} para criar dependência.

source: Make sure it is included in your platform and not excluded from your suite.
pt_br: Certifique-se que ele está incluído na sua plataforma e não foi excluído de sua suíte.

source: Cannot add library {0} to this module as it is.
pt_br: Não foi possível adicionar biblioteca {0} a este módulo da forma como está.

source: Make a library wrapper module for it and add that as a dependency.
pt_br: Crie um módulo encapsulador de biblioteca e o adicione como uma dependência .

source: Cannot add JAR {0} to this module as it is.
pt_br: Não foi possível adicionar o JAR {0} a este módulo como ele está.
